import numpy as np
import numpy.matlib

# 矩阵/数组的点积
a = np.array([[1,2],[3,4]])
b = np.array([[11,12],[13,14]])
c = np.dot(a, b)
print(c)
'''
1 2    11 12
3,4    13 14 
[
  [1*11+2*13=37 1*12+2*14=40]
  [3*11+4*13=85 3*12+4*14=92]
]
'''

# 向量的点积
a = np.array([[1,2],[3,4]])
b = np.array([[11,12],[13,14]])
c = np.vdot(a,b)
print(c)
'''
1*11 + 2*12 + 3*13 + 4*14 = 130
'''

# 数组向量的内积
a = np.array([[1,2],[3,4]])
b = np.array([[11,12],[13,14]])
c = np.inner(a,b)
print(c)
'''
[
  [1*11+2*12=35  1*13+2*14=41]
  [3*11+4*12=81  3*13_4*14=95 ]
'''

# 行列式计算，对角线乘积求差
# [[a,b],[c,d] --> ad-bc
a = np.array([[1,2],[3,4]])
c = np.linalg.det(a)
print(c) # -2
